Autodesk.Revit.UI.OpenOptionsForUI.DetachFromCentralOption
Specifies whether or not a workset-enabled document is detached from its central document.
Since:
2013

Autodesk.Revit.UI.OpenOptionsForUI.#ctor
Default constructor.
Since:
2013

Autodesk.Revit.UI.OpenOptionsForUI
This class contains options available for opening a document from disk via the method OpenAndActivateDocument.
Since:
2013